Repository: 84000/data-translation-memory
Catalog: toh232-v4.tmx
Source language: bo
Languages: en

source: །དེ་སྐད་ཅེས་སྨྲས་ནས་གནས་བརྟན་འོད་སྲུང་ཆེན་པོས་ལྷའི་བུ་མཐོང་ན་དགའ་བ་དྲི་ཟའི་རྒྱལ་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །གྲོགས་པོ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྐུ་ནི་ཆོས་ཀྱི་སྐུ་ཡིན་ནོ།
en: At these words, the elder Mahākāśyapa replied to the devaputra Gandharva King Delightful Appearance, saying, “Friend, the bodies of the tathāgatas are Dharma bodies.

source: །དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྐུ་ནི་རྡོ་རྗེ་མཁྲེགས་པ་ཡིན་ནོ།
en: The bodies of the tathāgatas are as hard as vajras.

source: །དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྐུ་ནི་དགེ་བ་ཐམས་ཅད་དང་ལྡན་པ་ཡིན་ནོ།
en: The bodies of the tathāgatas are endowed with all virtues.

source: །གྲོགས་པོ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྐུ་ནི་ཐབས་ཀྱི་སྐུ་ཡིན་གྱིས་ཤའི་སྐུ་མ་ཡིན་ནོ།
en: Friend, the bodies of the tathāgatas are not flesh bodies, because they are bodies of skillful means.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པའི་སྐུ་དེ་འདྲ་བ་ལ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ག་ལ་ཡོད།
en: Noble child, how could bodies such as the tathāgatas’ bodies pass into parinirvāṇa?

source: མི་རྟག་པར་ཡང་ག་ལ་ཞིག་འགྱུར་སྨྲས་པ།
en: How could they be impermanent?” “

source: བཙུན་པ་འོད་སྲུང་ཆེན་པོ་ཇི་ལྟར་ན་ཐབས་ཀྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་བརྗོད་ཀྱི་གཏན་དུ་མྱ་ངན་ལས་འདས་པ་ནི་མ་ཡིན།
en: So at this point, venerable Mahākāśyapa, although out of skillful means it is said that they pass into parinirvāṇa, it is not the case that they permanently pass into parinirvāṇa?” “

source: སྨྲས་པ། མཐོང་ན་དགའ་བ་དྲི་ཟའི་རྒྱལ་པོ་ཁྱོད་ལེགས་སོ་ལེགས་སོ།
en: Gandharva King Delightful Appearance, excellent, excellent!

source: །ཁྱོད་ཀྱིས་ཐབས་ཀྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་བརྗོད་ཀྱི། གཏན་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ནི་མ་ཡིན་ཞེས་ཚིག་འདི་ལེགས་པར་སྨྲས་པ་ནི་མཐོང་ན་དགའ་བ་དྲི་ཟའི་རྒྱལ་པོ་ཁྱོད་ལེགས་སོ།
en: Your statement that ‘although out of skillful means it is said that they pass into parinirvāṇa, it is not the case that they permanently pass into parinirvāṇa’ is well spoken. Excellent, Gandharva King Delightful Appearance!

source: །མཐོང་ན་དགའ་བ་དྲི་ཟའི་རྒྱལ་པོ་གཞན་ཡང་ཐམས་ཅད་དང་ཐུན་མོང་པའི་ཚད་ནི་རྟོགས་པར་ནུས་ཀྱི། སངས་རྒྱས་ཀྱི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་ནི་གཅིག་གི་ཚད་ཀྱང་རྟོགས་པར་མི་ནུས་སོ།
en: Gandharva King Delightful Appearance, moreover, although there are common measures through which all things can be understood, there is not a single measure through which one can understand the greatness of the Tathāgata’s virtuous qualities.” “

source: །སྨྲས་པ་བཙུན་པ་འོད་སྲུང་ཆེན་པོ་ཡུན་ཇི་སྲིད་ཅིག་ན་དེ་བཞིན་གཤེགས་པ་གཏན་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར།
en: Venerable Mahākāśyapa, when will the Tathāgata permanently pass into parinirvāṇa?” “

source: སྨྲས་པ། གང་གི་ཚེ་སེམས་ཅན་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཞིང་། མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཀྱང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་འགྱུར་བ་དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ།
en: When all sentient beings have become complete and perfect buddhas, attaining unsurpassed, complete, and perfect awakening, and then as complete and perfect buddhas have entered into parinirvāṇa, the Tathāgata will at that time enter into parinirvāṇa.” “

source: །སྨྲས་པ། །བཙུན་པ་འོད་སྲུང་ཆེན་པོ་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་ནི་ངོ་མཚར་ཆེ་སྟེ།
en: Venerable Mahākāśyapa, the greatness of the Tathāgata’s virtuous qualities is wondrous.

source: འདི་ལྟ་བུ་ཐོས་ན་སུ་ཞིག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་མི་བྱེད།
en: Who would not produce the aspiration to attain unsurpassed, complete, and perfect awakening on hearing such words?” “

source: སྨྲས་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྟག་པ་དང་། ཐེར་ཟུག་པ་དང་། བརྟན་པ་དང་། མི་བསྐྱོད་པ་དང་། དཔེ་མེད་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་པ་ནི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་ཀྱི་ཡུལ་མ་ཡིན་ཏེ།
en: The venerable bhagavān Tathāgata is permanent, eternal, stable, immovable, incomparable, and inconceivable—he does not belong to the domain of śrāvakas and pratyekabuddhas.

source: དེ་བཞིན་གཤེགས་པ་དག་ནི་དེ་བཞིན་གཤེགས་པ་ཉིད་ཀྱིས་མཁྱེན་པར་ཟད་དོ།
en: Only the tathāgatas themselves can comprehend the tathāgatas.

source: །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བཏང་སྙོམས་སུ་གྱིས་ཤིག །
en: Noble child, you must engage in the conduct of a bodhisattva with equanimity!”

source: འོད་སྲུང་ཆེན་པོས་བསྟན་པ་འདི་བཤད་པ་ན་ལྷའི་བུ་ས་ཡ་དང་ཉིས་འབུམ་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ།
en: When Mahākāśyapa gave this explanation, one million two hundred thousand devaputras produced the aspiration to attain unsurpassed, complete, and perfect awakening.

source: སེམས་རབ་ཏུ་དགའ་ནས་དེའི་ཚེ་ཁ་འཐུན་པར་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །སངས་རྒྱས་མྱ་ངན་ཡོངས་མི་འདའ། །ཆོས་ཀྱང་ནུབ་པར་མི་འགྱུར་ཏེ།
en: With joyful minds, they uttered these verses together in a single voice: “The Buddha will not pass into parinirvāṇa, And the Dharma will not disappear.

source: །སེམས་ཅན་རྣམས་ནི་སྨིན་མཛད་ཕྱིར། །ཡོངས་སུ་མྱ་ངན་འདའ་བ་སྟོན།
en: To bring sentient beings to maturity, He displays his passing into parinirvāṇa. “

source: །བཅོམ་ལྡན་སངས་རྒྱས་བསམ་མི་ཁྱབ།
en: The bhagavān Buddha is inconceivable.

source: །དེ་བཞིན་གཤེགས་པ་རྟག་པའི་སྐུ།
en: The Tathāgata’s body is permanent.

source: །སེམས་ཅན་རྣམས་ལ་ཕན་པའི་ཕྱིར། །ཆོས་རྣམས་སྣ་ཚོགས་སྟོན་པ་མཛད། །
en: To benefit all sentient beings, You teach these various dharmas.”

source: མདོ་དང་། ཏིང་ངེ་འཛིན་དང་། ཆོས་ཀྱི་སྒོ་དང་། གསང་བ་ཞུ་བ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་གཏན་ལ་དབབ་པར་བསྟན་པ་ལས། དམ་པའི་ཆོས་ཀྱི་དཀྱིལ་འཁོར་གྱི་ཕུང་པོའི་ལེའུ་ཞེས་བྱ་སྟེ། སུམ་ཅུ་བདུན་པའོ།། །།
en: As the teachings on the discourse itself, the samādhis, the Dharma gateways, the questions concerning secrets, and parinirvāṇa have been established, this concludes the thirty-seventh chapter on the aggregated maṇḍalas of the sacred Dharma.

source: དེ་ནས་དེའི་ཚེ་ལྷོ་ཕྱོགས་ཀྱི་ཡུལ་འདབ་སྟང་ཟིལ་གྱི་རི་ལས་འོད་སྲུང་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་འོངས་པའི་ལྷའི་བུ་རྣམས་སྟེང་གི་བར་སྣང་ལ་ཏ་ལ་བདུན་སྲིད་ཙམ་དུ་འཁོད་ནས་དེ་བཞིན་གཤེགས་པ་ལ་མེ་ཏོག་སིལ་མའི་རིམ་པ་རི་རབ་ཙམ་དག་གཏོར་ནས། མིག་མཆི་མས་གང་སྟེ་ངུ་བཞིན་དུ་ཚིག་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: At that time, a host of devaputras arrived from the Obsidian Mountain in the southern lands. Together with Mahākāśyapa, they ascended into empty space, hovering at a distance equal to the height of seven tala trees. From there, they scattered flower petals down upon the Tathāgata, piling up layers of petals as high as Mount Meru. Thereupon, their eyes filled with tears, and with voices wailing they addressed the Bhagavān, saying,

source: །ཀྱེ་མ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཐབས་ཀྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ན། དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་མདོ་འདི་ལྟ་བུ་འདི་དག་འཆང་བར་བགྱིད་པའི་སེམས་ཅན་དེ་དག་ཅི་འདྲ་བ་དག་ཅིག་འབྱུང་བར་འགྱུར།
en: “Alas, Bhagavān! When the Tathāgata has passed into parinirvāṇa out of skillful means, what sorts of sentient beings will arise to maintain those discourses such as this one, which were spoken by the Tathāgata?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལྷའི་བུ་དག་ང་འདས་པའི་འོག་ཏུ་དགེ་བའི་རྩ་བ་བྱས་པ་རྣམས་དང་། སངས་རྒྱས་མང་པོ་ལ་བསྙེན་བཀུར་བྱས་པ་དེ་དག་མདོ་སྡེ་འདི་ལྟ་བུ་འདི་དག་འཆང་བར་འགྱུར་ཏེ། གཞན་དག་ལ་ཡང་རྒྱས་པར་སྟོན་པར་འགྱུར་རོ།
en: The Bhagavān replied, “Devaputras, after I am gone, those who have produced virtuous roots and those who have paid veneration to many buddhas will maintain the discourses such as this and extensively teach them to others.

source: །སྤྲིན་ཆེན་པོའི་མདོ་འདི་ཡང་ལོ་བཞི་བཅུའི་བར་དུ་འཛམ་བུའི་གླིང་ན་སྤྱོད་པར་འགྱུར་ཏེ་རྒྱས་པར་ཡང་འགྱུར་རོ།
en: This Great Cloud discourse will circulate within Jambudvīpa for forty years and become widespread.

source: །དེའི་འོག་ཏུ་ཕྱི་མའི་དུས་ན་དམ་པའི་ཆོས་སྤོང་བ་དང་། རྒྱལ་པོ་འཁྲུག་པ་དང་། དམ་པའི་ཆོས་ནུབ་པར་འགྱུར་བ་མ་འོངས་པའི་དུས་དེ་ན་དགེ་སློང་དང་དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་ལུས་ཡོངས་སུ་མ་སྦྱངས་པ་དང་། ཚུལ་ཁྲིམས་ཡོངས་སུ་མ་སྦྱངས་པ་དང་། སེམས་ཡོངས་སུ་མ་སྦྱངས་པ་དང་། ཤེས་རབ་ཡོངས་སུ་མ་སྦྱངས་པ་དང་།
en: At a later time, people will abandon the sacred Dharma, rulers will breed conflicts, and the sacred Dharma will disappear. At that time, there will be monks, nuns, laymen, and laywomen who no longer train their bodies, train in discipline, train their minds, and train in wisdom.

source: ཤེས་རབ་འཆལ་པ་དང་། ལུག་ལྟར་ལྐུགས་པ་དང་། ཤེས་རབ་ཡོངས་སུ་ཉམས་པ་རྣམས་ཀྱིས་མདོ་འདི་ལྟ་བུ་འཆད་པ་ཐོས་ན་ཡིད་མི་ཆེས་ཤིང་བགད་པར་བྱེད།
en: Lacking in wisdom and stupid as sheep, when those with completely impaired wisdom hear the explanations of discourses such as this one, they will not believe it.

source: སྟིང་བར་བྱེད། འཕྱ་བར་བྱེད་ལ། ལྐོག་ཏུ་སོང་ནས་ཕན་ཚུན་ཟློས་ཤིང་སྨོད་པར་བྱེད་དེ་འཕྱ་བའི་བསམ་པས་དེ་དག་ཚིག་འདི་སྐད་དུ་ངོ་མཚར་ཏོ།
en: Laughing at it, criticizing it, and deriding it, they will meet in private to repeat their slander among themselves. With derisive thoughts, they will say of those who teach this discourse,

source: །དགེ་སློང་འདི་དག་ནི་བླུན་ཞིང་མུ་ཅོར་སྨྲ་བ་སྟེ།
en: ‘Amazing! These monks are foolish and speak nonsense.

source: འདི་དག་ནི་གང་ཡང་རུང་སྟེ། སངས་རྒྱས་ཀྱིས་གསུངས་པ་མ་ཡིན་གྱི་སྙན་དངགས་མཁན་དག་གིས་རང་བཟོར་ཚིག་དང་། ཡི་གེའི་འབྲུ་སྣ་ཚོགས་སྦྱར་ཏེ། འཁོར་གྱི་ནང་དུ་སོང་ནས་སྨྲ་བར་བྱེད་པར་ཟད་དེ།
en: Whatever they say was not spoken by the Buddha. Those are just the words of people skilled in composition, who write various words, circulate these writings within their own circles, and then go out and proclaim them.

source: མདོ་འདི་དག་ནི་སངས་རྒྱས་ཀྱིས་གསུངས་པ་མ་ཡིན་ནོ་ཞེས་ཟེར་རོ།
en: Discourses such as these were not spoken by the Buddha.’

source: །དེ་ལྟར་གཏི་མུག་ཅན་གྱི་མི་བསོད་ནམས་ཆུང་བ། ཤེས་རབ་འཆལ་པ། ལུག་ལྟར་ལྐུགས་པ། ཤེས་རབ་ཡོངས་སུ་ཉམས་པ། དམ་པའི་ཆོས་ལ་སུན་འབྱིན་པ་དེ་དག་འབྱུང་བར་འགྱུར་རོ།
en: Thus, there will arise ignorant people like these, with little merit, lacking in wisdom, stupid as sheep, their wisdom impaired, who will disparage the sacred Dharma. “

source: །ལྷའི་བུ་དག་གཞན་ཡང་དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་བསོད་ནམས་ཆུང་བ། ཤེས་རབ་ཞན་པ། ཤེས་རབ་འཆལ་པ། ཤེས་རབ་རྟུལ་བ། ཤེས་རབ་ཆུང་བ། ཤེས་རབ་ཡོངས་སུ་ཉམས་པ། སྔོན་གྱི་རྒྱལ་བ་རྣམས་ལ་བྱ་བ་མ་བྱས་པ། བླ་ན་མེད་པའི་ཆོས་རིན་པོ་ཆེ་ལས་ཡོངས་སུ་ཉམས་པ། ཆོས་རིན་པོ་ཆེ་ལས་ཡེ་ཕྱི་རོལ་ཏུ་གྱུར་པ། ཆོས་རིན་པོ་ཆེ་ཡོངས་སུ་སྤངས་པ། དགེ་བའི་རྩ་བ་ཆུང་བ། མུ་གེའི་མགོ་བྱི་གདུལ་དཀའ་བ། དམུ་རྒོད་དག་འབྱུང་བར་འགྱུར་རོ། །
en: Furthermore, devaputras, there will appear monks, nuns, laymen, and laywomen with little merit, weak wisdom, lack of wisdom, dull wisdom, little wisdom, and completely impaired wisdom who have not rendered service to the conquerors of the past, who have completely deviated from the precious and unsurpassed Dharma, who have forever become outsiders to the precious Dharma, who have completely abandoned the precious Dharma, who have few virtuous roots, who are famished bald-heads, and who are rough and difficult to tame.

source: བྲན་ཕོ་དང་། བྲན་མོ་ཡོངས་སུ་འཛིན་པ་དག་འབྱུང་བར་འགྱུར་རོ།
en: There will appear monks, nuns, laymen, and laywomen who keep male and female servants.

source: །དབྱིག་དང་། གསེར་ཡོངས་སུ་འཛིན་པ་དག་འབྱུང་བར་འགྱུར་རོ། །
en: There will appear some who keep gold and jewels.

source: དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་ཡོངས་སུ་འཛིན་པ་དག་འབྱུང་བར་འགྱུར་རོ།
en: There will appear some who keep shells, crystals, and coral.

source: །བ་ལང་དང་། མ་ཧེ་ཡོངས་སུ་འཛིན་པ་དག་འབྱུང་བར་འགྱུར་རོ།
en: There will appear some who keep cattle and water buffalo.

source: །ཞིང་གི་དངོས་པོ་ཡོངས་སུ་འཛིན་པ་དག་འབྱུང་བར་འགྱུར་རོ།
en: There will appear some who keep fields and property.

source: །ངང་པ་དང་། བྱ་གག་དང་། ཕག་ལ་སོགས་པའི་གནས་ཀྱི་རྫས་དུ་མ་ཡོངས་སུ་འཛིན་པ་དག་འབྱུང་བར་འགྱུར་རོ།
en: There will appear some who keep breeding grounds for ducks, chickens, pigs, and the like.

source: །ལས་ཆེན་པོ་རྣམ་པ་བཅུ་དྲུག་བྱེད་དུ་འཇུག་པ་དག་ཀྱང་འབྱུང་བར་འགྱུར་རོ།
en: There will appear some who engage in the sixteen great inexpiable occupations.

source: །རྒྱལ་པོ་ལ་བསྟེན་པ་དག་ཀྱང་འབྱུང་བར་འགྱུར་རོ།
en: There will appear some who serve kings.

source: །ཕོ་ཉ་བྱེད་པ་དག་ཀྱང་འབྱུང་བར་འགྱུར་རོ།
en: There will appear some who serve as messengers.

source: །དུག་སྦྱོར་དུ་འཇུག་པ་དག་ཀྱང་འབྱུང་བར་འགྱུར་རོ།
en: There will appear some who compound poisons.

source: །དགེ་སློང་གི་ལས་མ་ཡིན་པ་དུ་མ་བྱེད་པ་དང་། བྱེད་དུ་འཇུག་པ་དག་ཀྱང་འབྱུང་བར་འགྱུར་རོ།
en: There will appear some who engage in all sorts of activities that are inappropriate for monks. “

source: །དེ་ལྟར་མི་གཏི་མུག་ཅན་དེ་དག་ཡོངས་སུ་འཕེལ་བའི་དུས་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་ཉམས་པའི་དུས་ན་འོད་སྲུང་ཆེན་པོ་དང་། འདྲ་བའི་དགེ་སློང་འཛམ་བུའི་གླིང་དུ་སྐྱེ་བར་འགྱུར་ཏེ།
en: At that time, when ignorant people such as these are flourishing and the sacred Dharma is in complete decline, a monk like Mahākāśyapa will appear in Jambudvīpa.

source: ངའི་ཉན་ཐོས་ཀྱི་ནང་དུ་བྱུང་ནས་རིམ་གྱིས་མུ་གེའི་མགོ་བྱི་གདུལ་དཀའ་བ།
en: He will go forth to renunciation among my disciples.

source: དམུ་རྒོད་རྣམས་ཀྱི་ནང་དུ་དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་མདོ་རྣམས་ཀྱི་བསྔགས་པ་བརྗོད་ཅིང་།
en: Gradually, among all those rough and difficult-to-tame, famished bald-heads, he will praise those discourses spoken by the Tathāgata.

source: སོ་སོར་ཐར་པའི་སྡོམ་པས་བསྡམས་ཏེ། མཇུག་ཏུ་རང་གི་སྲོག་དང་བསྡོས་ནས་བསླབ་པའི་གཞི་བཅས་པའི་བར་བསྔགས་པ་བརྗོད་པར་འགྱུར་རོ།
en: Risking his own life, he will praise everything from vows according to the pratimokṣa down to the basic precepts.

source: །དེའི་འོག་ཏུ་ཤིང་དྲུང་གི་བསྔགས་པ་བརྗོད་པར་འགྱུར་རོ།
en: After that, he will praise sitting under trees.

source: །དེ་བཞིན་དུ་ཕྱག་དར་ཁྲོད་དང་། དགོན་པ་ན་གནས་པ་དང་། འདུལ་བའི་བསྔགས་པ་བརྗོད་ཅིང་མ་དུལ་བ་རྣམས་ཚར་གཅོད་པར་འགྱུར་རོ།
en: Similarly, he will praise wearing rags, abiding in the wilderness, and observing discipline, and he will expel those who are undisciplined.

source: །ལྷའི་བུ་དག་ཁྱོད་ཀྱིས་ངའི་ཉན་ཐོས་ཐེག་པ་ཆེན་པོ་ལ་དད་པ་རྙེད་པ་དང་། དགེ་སློང་འདོད་ཅིང་བྱམས་པ་ལ་གནས་པ་དེ་ལ་ཀུན་ཏུ་བསྲུང་བ་གྱིས་ཤིག །
en: Devaputras, you must guard my disciple who develops faith in the Great Vehicle, the monk who desires the Dharma and abides in loving-kindness!”

source: ལྷའི་བུ་རྣམས་ཀྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་ཀྱང་དགེ་སློང་འདོད་ཅིང་བྱམས་པ་ལ་གནས་པ་དེ་ལ་བསྙེན་བཀུར་དང་གཡོག་བགྱིས་ཏེ། ཀུན་ཏུ་བསྲུང་བར་ཡང་བགྱིའོ།
en: The devaputras replied, “Bhagavān, we will venerate, serve, and guard that monk who desires the Dharma and abides in loving-kindness.

source: །བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་ཀྱང་སངས་རྒྱས་ཀྱི་མཐུས་བདུད་སྡིག་ཅན་ཚར་གཅད་པར་བགྱིའོ།
en: Bhagavān, through the Buddha’s power we will subjugate evil Māra.

source: །ཆོས་མ་ལགས་པའི་ཕྱོགས་མུ་གེའི་མགོ་བྱི་གདུལ་དཀའ་བ་དམུ་རྒོད་རྣམས་ཡུལ་ནས་བསྐྲད་པར་བགྱིའོ།
en: We will banish all those rough and difficult-to-tame, famished bald-heads to those lands where the Dharma is nonexistent.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལྷའི་བུ་དག་ལེགས་སོ་ལེགས་སོ། །ཁྱོད་ཀྱིས་རྐྱེན་དུ་བབ་པར་དམ་བཅས་ཤིང་སྨོན་ལམ་བཏབ་སྟེ།
en: The Bhagavān replied, “Devaputras, it is excellent, excellent, that you have made such vows and aspirations.

source: དགེ་སློང་འདོད་པའི་སྐྱེས་བུ་དམ་པ་དེ་ལ་ནི་ལྷ་རྣམས་ཀྱང་སྲུང་ངོ་། །ལྷ་རྣམས་ཀྱང་དེའི་བསྔགས་པ་བརྗོད་དོ།
en: That sacred being, the monk who desires the Dharma, will be protected by all the gods, and all the gods will praise him.

source: །དེ་བཞིན་གཤེགས་པ་ཡང་ངའི་ཉན་ཐོས་དཀའ་བ་བྱེད་པ་ཡིན་ནོ་སྙམ་དུ་དགོངས་ནས་བསྔགས་པ་རྗོད་པར་མཛད་དོ།
en: The Tathāgata will also praise him, thinking, ‘That disciple of mine has undertaken hardship.’ ”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཡང་ལྷའི་བུ་རྣམས་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ལྷའི་བུ་དག་སེམས་ཅན་གྱི་དོན་འདོད་པའི་རིགས་ཀྱི་བུས་ནི་དམ་པའི་ཆོས་ཀུན་ཏུ་བསྲུང་བར་བྱའོ།
en: ” The Bhagavān then further addressed the devaputras, saying, “Devaputras, those noble children who desire benefit for sentient beings will guard the sacred Dharma.”

source: །དེ་ནས་ལྷའི་བུ་མང་པོ་དག་གིས་བཅོམ་ལྡན་འདས་ལ་རིན་པོ་ཆེའི་གདུགས་ཀྱིས་མངོན་པར་བཀབ་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཡུན་ཇི་སྲིད་ཅིག་ན་དེ་བཞིན་གཤེགས་པའི་སྲས་འོད་སྲུང་ཆེན་པོ་དང་འདྲ་བའི་དགེ་སློང་འབྱུང་བར་འགྱུར།
en: At this point, all the many devaputras covered the Bhagavān with jeweled umbrellas and addressed him, saying, “Bhagavān, when will the Tathāgata’s son, the monk who is like Mahākāśyapa, arise?

source: གང་དུ་ནི་སྐྱེ་བར་འགྱུར།
en: Where will he be born?

source: དེའི་མིང་ནི་ཇི་སྐད་ཅེས་བགྱི་བར་གཟུང་བར་འཚལ།
en: By what name will he be known?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལྷའི་བུ་དག་ང་འདས་པའི་འོག་ལོ་བརྒྱ་ཕྲག་མང་པོ་འདས་པ་ན་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་དུ་མཁར་གྱི་རྒྱལ་པོ་བདེ་སྤྱོད་ཅེས་བྱ་བ་འབྱུང་བར་འགྱུར་ཏེ།
en: The Bhagavān replied, “Devaputras, many hundreds of years after I am gone, in the southern region there will appear a ruler of a stronghold who is named Joyful Conduct.

source: དེའི་ཚེ་ལོ་བརྒྱད་ཅུ་ན་དམ་པའི་ཆོས་ནུབ་པར་འགྱུར་བའི་ལྷག་མ་ཙམ་དུ་ལུས་པའི་དུས་ལ་བབ་པ་དེའི་ཚེ་ངའི་ཉན་ཐོས་འབྱུང་བར་འགྱུར་ཏེ།
en: At that time, the sacred Dharma will have been in decline for eighty years, leaving behind only minute traces. Then, my disciple will appear.

source: དམ་པའི་ཆོས་ཀྱང་འབྱིན་པར་འགྱུར། ཆོས་ཀྱི་འཁོར་ལོ་ཡང་བསྐོར་བར་འགྱུར། ཐེག་པ་ཆེན་པོ་ཡང་གཞན་དག་ལ་རྒྱས་པར་འཆད་པར་འགྱུར་རོ།
en: He will bestow the sacred Dharma, turn the wheel of Dharma, and extensively expound the Great Vehicle to others.

source: །མདོ་སྡེ་འདི་ལྟ་བུ་དག་བཤད་པ་ཐོས་ནས་སྔོན་གྱི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ལས་གང་དག་ཐོས་པ་དེ་དག་ཀྱང་ཕྱི་མའི་དུས་ཀྱི་ཚེ་འཛིན་པར་འགྱུར། ཀུན་ཆུབ་པར་བྱེད་པར་འགྱུར། འཆང་བར་འགྱུར། ཀློག་པར་འགྱུར། ཡིད་ཆེས་པར་འགྱུར་རོ།
en: After having heard explanations of discourses such as this, those who have heard of those complete and perfect buddhas of the past will, in this future time, uphold these discourses, realize them, bear them in mind, recite them, and trust in them.

source: །སེམས་ཅན་གང་དག་དེ་བཞིན་གཤེགས་པའི་མཚན་འདི་དག་ཐོས་ན་ཡིད་མི་ཆེས་པ་དང་། མ་དད་པ་དང་། ཁ་ཏོན་མི་བྱེད་པ་དང་། མི་ཀློག་པ་དང་། མི་འདྲི་བ་དེ་དག་ནི་བདུད་ཀྱིས་བྱིན་གྱིས་བརླབས་པ་ཡིན་ནོ།
en: Those sentient beings who, when they hear the names of these tathāgatas, do not trust in them, do not develop faith in them, do not chant them, do not recite them, and do not inquire about them will have fallen under the magical power of Māra.

source: །སེམས་ཅན་གང་དག་དེ་བཞིན་གཤེགས་པའི་མཚན་འདི་དག་ཐོས་ན་ཡིད་ཆེས་པར་བྱེད་ཅིང་དད་པར་འགྱུར་བ་དང་། ཁ་ཏོན་བྱེད་པ་དང་། ཀློག་པ་དང་། འདྲི་བ་དེ་དག་ནི་སངས་རྒྱས་མང་པོས་ཡོངས་སུ་བཟུང་བ་ཡིན་ནོ།
en: However, those sentient beings who, when they hear the names of these tathāgatas, trust in them, develop faith in them, chant them, recite them, and inquire about them will be fully supported by many buddhas.”

source: །དེ་ནས་དེའི་ཚེ་ལྷའི་བུ་མཐོང་ན་དགའ་བ་དྲི་ཟའི་རྒྱལ་པོས་བཅོམ་ལྡན་འདས་ལ་བསྐོར་བ་བྱས་ཏེ། ལན་ས་ཡར་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: At that time, the devaputra Gandharva King Delightful Appearance circumambulated the Bhagavān one million times and then prostrated, touching his head to the Bhagavān’s feet.

source: །བཅོམ་ལྡན་འདས་འོད་སྲུང་ཆེན་པོ་དང་འདྲ་བ་དེ་བཞིན་གཤེགས་པ་དང་མིང་འཐུན་པ། བྱམས་པ་ཆེན་པོ་ལ་གནས་པ། ཚུལ་ཁྲིམས་ཆེན་པོ་ལ་དྲག་ཏུ་བརྩོན་པ་ཤིན་ཏུ་མཆོག་ཏུ་མཛེས་པ། རིགས་ཆེན་པོར་སྐྱེས་པ། ཚུལ་ཁྲིམས་དང་ལྡན་པ་ཆེན་པོ་དགེ་སློང་གིས་ཡོངས་སུ་བསྐོར་བ། དུས་དང་བཅས། གྲོང་དང་བཅས་པ་དང་།
en: He then addressed the Bhagavān, saying, “Bhagavān, regarding that monk who is like Mahākāśyapa, who is named after the Tathāgata, who abides in great loving-kindness, who strives fiercely toward great discipline, who is supremely handsome, who is born to a great family, who is surrounded by monks endowed with great discipline—when, in what town, and in what form will he appear?

source: རྣམ་པ་ཅི་འདྲ་བ་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱས་པར་བཤད་དུ་གསོལ།
en: Bhagavān, I beseech you to explain this in detail.

source: བཅོམ་ལྡན་འདས་དགེ་སློང་དེ་བདག་གིས་ཇི་སྲིད་འཚོའི་བར་དུ་བསྲུང་བར་བགྱིའོ།
en: Bhagavān, I will guard that monk for as long as I live.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མཐོང་ན་དགའ་བ་དྲི་ཟའི་རྒྱལ་པོ་དགེ་སློང་དེ་ལུང་བསྟན་པ་ཉོན་ཅིག །
en: The Bhagavān replied, “Gandharva King Delightful Appearance, listen to the prophecy of this monk.

source: དེ་ནི་ང་ལ་དབེན་པ་དང་། ངའི་བསྟན་པ་འབྱུང་བར་བྱེད་ཅིང་ཁུར་ཆེན་པོ་ཁྱེར་བ་དང་། ངའི་ཤཱཀྱ་གཞོན་ནུ་ཡིན་ཏེ།
en: He will be devoted to me, he will cause my teachings to appear and bear their burden, and he will be a youth of my Śākya family.

source: མཐོང་ན་དགའ་བ་དྲི་ཟའི་རྒྱལ་པོ་ང་འདས་པའི་འོག་ཏུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་དུ་དྲང་སྲོང་བྱི་བོ་ཞེས་བྱ་བའི་ཡུལ་འཁོར་དུ་བསོད་ནམས་ཀྱི་གྲོང་ཁྱེར་བྱེ་མ་ཆེན་པོ་ཞེས་བྱ་བ་འབྱུང་སྟེ།
en: Gandharva King Delightful Appearance, after I am gone, in the southern region there will arise a land called Bald Ṛṣi, where there will emerge a meritorious town called Great Sands.

source: གྲོང་དེའི་འབབ་ཆུ་མཛེས་འབྱོར་ཅེས་བྱ་བ་དེའི་བྱང་ཕྱོགས་ཀྱི་འགྲམ་དུ་འབྱུང་བར་འགྱུར་རོ།
en: In that town, there will be a river called Abundant Beauty.

source: །དེར་རྗེའུ་རིགས་ཆེན་པོ་རྣམ་པར་དག་པ་འབྲ་གོ་ཅན་ཞེས་བྱ་བའི་སའི་ཕྱོགས་སུ་འབྱུང་བར་འགྱུར་ཏེ།
en: In a district on the northern side of that river a great pure merchant family will arise in a place called Kharjūrikā.

source: ཤཱཀྱའི་རིགས་གཞོན་ནུ་ལིད་ཙ་བཱིའི་བུ་གཞོན་ནུ་འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་མཐོང་ན་དགའ་བ་དེ་ངའི་ཆོས་འབྱུང་བར་བྱ་བའི་ཕྱིར་ལིད་ཙ་བཱིའི་བུ་གཞོན་ནུ་འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་མཐོང་ན་དགའ་བ་བྱང་ཆུབ་སེམས་དཔའ་མི་མཆོག་དེ་དེར་རིགས་ཆེན་པོར་སྐྱེ་བར་འགྱུར་ཏེ།
en: In order to cause my Dharma to appear, the youth of the Śākya family, the Licchavi youth Admired by All Worlds, will be born into that great family as a supreme man and bodhisattva.

source: དེའི་ཕ་མ་དང་གཉེན་སྡེ་རྣམས་ཀྱིས་ངའི་མིང་དེའི་མིང་དུ་འདོགས་པར་འགྱུར་རོ།
en: His parents and relatives will name him after me.

source: །འབྲ་གོ་ཅན་གྱི་རྗེའུ་རིགས་ཆེན་པོའི་རིགས་ཀྱང་དེ་བཞིན་གཤེགས་པའི་རིགས་ཡིན་པར་བལྟའོ།
en: Thus, the great merchant family of Kharjūrikā should be viewed as the family of the Tathāgata. “

source: །དེའི་ཚེ་དྲང་སྲོང་བྱི་བོའི་ཡུལ་འཁོར་ཡང་འབྱོར་ཅིང་རྒྱས་ལ་སྐྱེ་བོ་མང་པོས་གང་བར་འགྱུར་རོ།
en: At that time, the land of Bald Ṛṣi will be abundant and flourishing and full of many beings.

source: །དེ་བཞིན་གཤེགས་པ་དང་མིང་འཐུན་པའི་ཁྱེའུ་དེ་ཡང་སྐྱེ་བོ་ཐམས་ཅད་ཀྱི་སྙིང་དུ་སྡུག་པར་འགྱུར་ཞིང་སྐྱེ་བོ་མང་པོ་ཐམས་ཅད་ཀྱིས་བཀུར་བར་འགྱུར་རོ།
en: The child named after the Tathāgata will be loved and venerated by all beings.

source: །གང་གི་ཚེ་ཁྱེའུ་དེ་རབ་ཏུ་བྱུང་བ་ན་ཚངས་པ་མཚུངས་པར་སྤྱོད་པའི་འཁོར་དང་། དགེ་སློང་གི་ཚོགས་རྣམས་ཁྲིད་དེ།
en: When that child goes forth to renunciation, he will lead a retinue of celibate practitioners and a host of monks.

source: རང་གི་སྲོག་དང་བསྡོས་ནས་དམ་པའི་ཆོས་སྟོན་ཅིང་། དེ་བཞིན་གཤེགས་པའི་སྤྱོད་པ་འབྱུང་བར་བྱེད་དེ། མཆོག་ཏུ་དགའ་བ་སྤྱོད་པར་འགྱུར་རོ། །
en: Risking his own life to teach the sacred Dharma and to cause the conduct of the Tathāgata to appear, he will carry out the conduct that is supremely difficult.

source: དགེ་སློང་དམ་པའི་ཆོས་འདོད་པ་དེའི་འཁོར་གང་ཡིན་པ་རྣམས་ཀྱང་རང་གི་སྲོག་གི་བསམ་པ་ཡོངས་སུ་བཏང་ནས་དམ་པའི་ཆོས་སྲུང་བར་འགྱུར་ཏེ།
en: The companions of that monk who desires the sacred Dharma will abandon thinking of their own lives and will guard the sacred Dharma.

source: དགེ་སློང་གི་ཚོགས་དེ་དག་ཀྱང་མཆོག་ཏུ་དཀའ་བ་བྱེད་པ་དང་།
en: That assembly of monks will engage in conduct that is exceedingly difficult.

source: ང་ལ་དབེན་པ་དང་། ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པར་འགྱུར་ཞིང་སོ་སོར་ཐར་པའི་སྡོམ་པས་བསྡམས་ལ་སྤྱོད་པ་དང་།
en: They will respect me and develop pure discipline, restraining themselves with the pratimokṣa vows.

source: སྤྱོད་ཡུལ་ཕུན་སུམ་ཚོགས་པ་དང་། ཁ་ན་མ་ཐོ་བ་ཕྲ་རབ་ཙམ་ལ་ཡང་འཇིགས་པར་ལྟ་བར་འགྱུར་རོ།
en: Their conduct and the domain of their conduct will be perfectly complete, and they will not have to worry about engaging in even the slightest of misdeeds.

source: །དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་གང་དག་ངའི་ཉན་ཐོས་མཆོག་ཏུ་དཀའ་བ་བྱེད་པའི་ཚིག་ལ་ཡིད་ཆེས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་སྤྲིན་ཆེན་སྙིང་པོ་དང་འདྲ་བར་བལྟའོ།
en: Whichever monks, nuns, laymen, or laywomen develop trust in the supremely difficult words of this disciple of mine should all be regarded as being just like Great Cloud Essence. “

source: །མཐོང་ན་དགའ་བ་དྲི་ཟའི་རྒྱལ་པོ་གཞན་ཡང་སྐྱེ་བོ་དགེ་བསྙེན་གང་དག་གིས་ངའི་ཉན་ཐོས་ཀྱི་ཚིག་ཐོས་ནས་དམ་པའི་ཆོས་ཀྱི་ཕྱོགས་འཛུགས་པར་བྱེད་པའི་སེམས་ཅན་དེ་དག་ཀྱང་ང་ལ་བྱས་པ་གཟོ་བ་དང་།
en: Furthermore, Gandharva King Delightful Appearance, whichever virtuous beings establish themselves firmly in the land of the sacred Dharma, hearing the words of my disciple will lead those sentient beings to show gratitude and respect toward me.
